In [45]:
import pandas as pd
import numpy as np
f=pd.read_csv("train.csv")
f.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [46]:
f.drop("PassengerId",axis=1,inplace=True)

In [47]:
f.drop("Name",axis=1,inplace=True)

In [48]:
f.drop("SibSp",axis=1,inplace=True)

In [49]:
f.drop("Parch",axis=1,inplace=True)

In [50]:
f.drop("Ticket",axis=1,inplace=True)

In [51]:
f.drop("Cabin",axis=1,inplace=True)

In [52]:
f.drop("Embarked",axis=1,inplace=True)

In [53]:
f.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [54]:
f.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
Fare          0
dtype: int64

In [55]:
f.dropna(inplace=True)

In [56]:
x=f.drop("Survived",axis='columns')
y=f["Survived"]

In [57]:
x

     Pclass     Sex   Age     Fare
0         3    male  22.0   7.2500
1         1  female  38.0  71.2833
2         3  female  26.0   7.9250
3         1  female  35.0  53.1000
4         3    male  35.0   8.0500
..      ...     ...   ...      ...
885       3  female  39.0  29.1250
886       2    male  27.0  13.0000
887       1  female  19.0  30.0000
889       1    male  26.0  30.0000
890       3    male  32.0   7.7500

[714 rows x 4 columns]

In [58]:
y

0      0
1      1
2      1
3      1
4      0
      ..
885    0
886    0
887    1
889    1
890    0
Name: Survived, Length: 714, dtype: int64

In [59]:
from sklearn.preprocessing import LabelEncoder

In [60]:
sex_=LabelEncoder()

In [61]:
x['sex']=sex_.fit_transform(x['Sex'])

In [62]:
x

     Pclass     Sex   Age     Fare  sex
0         3    male  22.0   7.2500    1
1         1  female  38.0  71.2833    0
2         3  female  26.0   7.9250    0
3         1  female  35.0  53.1000    0
4         3    male  35.0   8.0500    1
..      ...     ...   ...      ...  ...
885       3  female  39.0  29.1250    0
886       2    male  27.0  13.0000    1
887       1  female  19.0  30.0000    0
889       1    male  26.0  30.0000    1
890       3    male  32.0   7.7500    1

[714 rows x 5 columns]

In [63]:
x.drop("Sex",axis=1,inplace=True)

In [68]:
from sklearn.model_selection import train_test_split

In [69]:
from sklearn import tree
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=101)

In [75]:
model=tree.DecisionTreeClassifier()
model.fit(x_train,y_train)
y_pred=model.predict(x_test)
model.score(x_test,y_test)
y_pr=np.array(y_pred).reshape(-1,1)
from sklearn.metrics import accuracy_score
accuracy_score(y_test,y_pr)

0.7552447552447552